[{"Author":"Kyubey","Date":"2015-04-01T10:18:00","Tags":["c#",".net","vb.net","faq","c#-faq"],"Topic":"Что такое NullReferenceException, и как мне исправить код?","Text":"Когда я выполняю некоторый код, выбрасывается исключение NullReferenceException со следующим сообщением:\r\nObject reference not set to an instance of an object.\r\nили\r\nВ экземпляре объекта не задана ссылка на объект.\r\nЧто это значит, и как мне исправить код ?","Answers":[{"Author":"Kyubey","Date":"2015-04-01T10:18:00","Text":"Вы пытаетесь воспользоваться чем-то, что равно null (или Nothing в VB.NET). Это означает, что либо вы присвоили это значение, либо вы ничего не присваивали.\r\n\r\nКак и любое другое значение, null может передаваться от объекта к объекту, от метода к методу. Если нечто равно null в методе \u0022А\u0022, вполне может быть, что метод \u0022В\u0022 передал это значение в метод \u0022А\u0022.","Rating":105,"NumberOfVotes":105},{"Author":"VladD","Date":"2015-11-26T13:09:00","Text":"В дополнение к ответу @Kyubey, давайте рассмотрим вопрос с другой стороны.\r\n\r\nЕсли у вас в процессе выполнения программы случился NullReferenceException при доступе по какой - то ссылке, вы должны прежде всего задать себе важный вопрос:\r\n\r\nа имеет ли право эта ссылка иметь значение null ?\r\n\r\nВо многих случаях правильным ответом будет «нет», и значит, исправлять придётся истинную причину ошибки, которая находится в другом месте, и произошла раньше.","Rating":38,"NumberOfVotes":38}]},{"Author":"Nofate","Date":"2018-04-06T15:07:00","Tags":["c#","книги","faq"],"Topic":"Книги и учебные ресурсы по C#","Text":"Вопросы о литературе по различным языкам программирования возникают очень часто. Здесь мы попробуем собрать лучшие ответы и рекомендации насчёт литературы и других учебных ресурсов по языку C#, платформе и популярным библиотекам.\r\n\r\nНе забывайте, однако, что никакая теория не заменит опыта программирования! Читайте, пробуйте, тренируйтесь. Спрашивайте, если непонятно. Попробуйте запрограммировать свой проект, это лучший путь.","Answers":[{"Author":"VladD","Date":"2020-11-09T16:48:00","Text":"Книги для новичков: а о чём это вообще?\r\n\r\nHead First C#, Jennifer Greene, Andrew Stellman (русский перевод: Изучаем C#, Д. Грин, Э. Стиллмен). Содержит упражнения. Рекомендуется многими как хорошая книга для новичков.\r\n\r\nC# 6.0 and the .NET 4.6 Framework (7th Edition), Andrew Troelsen, Philip Japikse (русский перевод предыдущего издания: Язык программирования C# 5.0 и платформа .NET 4.5, Эндрю Троелсен). Хорошая популярная книга, многие начинали с неё.\r\n\r\nКниги среднего уровня: если hello world не проблема\r\n\r\nCLR via C#. Программирование на платформе Microsoft .NET Framework 4.5 на языке C#, Джеффри Рихтер. Неувядающая классика. Хотите знать, что и как происходит на самом деле? Это книжка для вас. Не самое живое изложение, местами скучновата, зато максимум подробностей из первых рук.\r\nПредупреждение: Русский перевод от «Питер» ужасен: вас ждут выброшенные абзацы, опечатки и ляпы, меняющие смысл текста на противоположный. По возможности, читайте английский оригинал.\r\n\r\nEffective C# и More Effective C#, Bill Wagner. О том, как надо и как не надо программировать на C#. Разбираются отдельные аспекты программирования, способствует углублению понимания языка.","Rating":196,"NumberOfVotes":196}]},{"Author":"Kyubey","Date":"2015-05-01T09:32:00","Tags":["c#","книги","faq"],"Topic":"Как распарсить HTML в .NET?","Text":"Необходимо извлечь все URL из атрибутов href тегов a в HTML странице. Я попробовал воспользоваться регулярными выражениями.\r\n\r\nНо возникает множество потенциальных проблем:\r\n\r\nКак отфильтровать только специфические ссылки, например, по CSS классу?\r\nЧто будет, если кавычки у атрибута другие?\r\nЧто будет, если вокруг знака равенства пробелы?\r\nЧто будет, если кусок страницы закомментирован?\r\nЧто будет, если попадётся кусок JavaScript?\r\nИ так далее.\r\n\r\nРегулярное выражение очень быстро становится монструозным и нечитаемыми, а проблемных мест обнаруживается всё больше и больше.\r\n\r\nЧто делать?","Answers":[{"Author":"Kyubey","Date":"2015-05-01T09:32:00","Text":"Для парсинга HTML используте AngleSharp.\r\n\r\nЕсли вам нужно не только распарсить HTML, но и запустить полноценный браузер, выполнить все скрипты, понажимать на кнопки и посмотреть, что получилось, то используйте CefSharp или Selenium. Учтите, что это будет на порядки медленнее.","Rating":126,"NumberOfVotes":126},{"Author":"Vadim Ovchinnikov","Date":"2016-11-27T07:31:00","Text":"Используйте библиотеку CefSharp для решения подобных задач.","Rating":23,"NumberOfVotes":23},{"Author":"MSDN.WhiteKnight","Date":"2017-11-01T06:14:00","Text":"Если требования к производительности не очень высокие, можно использовать COM-объект Internet Explorer (добавить ссылку на Microsoft HTML Object Library).","Rating":8,"NumberOfVotes":8},{"Author":"Anatol","Date":"2019-02-10T04:32:00","Text":"Поиск на странице всех ссылок на книги по F#.","Rating":2,"NumberOfVotes":2},{"Author":"iRumba","Date":"2015-09-14T05:31:00","Text":"У меня все замечательно получается при помощи XElement Попробуйте :)\r\n\r\nКак подсказали в комментариях, это будет работать если нужная нам страница является валидным XHTML документом.","Rating":-4,"NumberOfVotes":4}]}]